app/Repositories/Eloquent/JournalRepository.php

select count(*) as aggregate from `journals`
---
	public function getAllJournal()
	{
		return Journal::with('user')->orderBy('created_at', 'DESC')->simplePaginate(10);